ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/lettergeneration/request_empty_meddelelseIndhold.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns="http://skat.dk/begrebsmodel/2009/01/15/"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <GenerateLetterEkspres_I>
            <Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>1d79eb22-ca52-4659-85f7-e061f914c28a</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2017-07-12T13:52:03</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </Kontekst>
            <FagsystemNavn>IND</FagsystemNavn>
            <MeddelelseBatchID>416409514939896482166052446</MeddelelseBatchID>
            <Meddelelse>
                <MeddelelseIndhold></MeddelelseIndhold>
                <MeddelelseTypeNummer>dummy</MeddelelseTypeNummer>
                <MeddelelseAfsenderReference>08987960730000000089879629020170505</MeddelelseAfsenderReference>
                <KundeNummer>0505771168</KundeNummer>
                <MeddelelseOprettetAfMedarbejder>HL</MeddelelseOprettetAfMedarbejder>
                <KanalTypeNummer>3</KanalTypeNummer>
                <KanalAdresseNavn>
                    <KundeNavn>SKAT Inddrivelse Test Person 140</KundeNavn>
                </KanalAdresseNavn>
                <KanalAdresseStruktur>
                    <AdresseValg>
                        <AlternativAdresseStruktur>
                            <AlternativAdresse>
                                <AlternativAdresseFortløbendeNummer>0</AlternativAdresseFortløbendeNummer>
                                <AlternativAdresseAnvendelseKode>0</AlternativAdresseAnvendelseKode>
                                <AlternativAdresseAdresseLinie1>Nordre Strandvej 12</AlternativAdresseAdresseLinie1>
                                <AlternativAdresseAdresseLinie2>3000 Helsingør</AlternativAdresseAdresseLinie2>
                                <AdresseTypeKode>0</AdresseTypeKode>
                                <LandKode>DK</LandKode>
                            </AlternativAdresse>
                        </AlternativAdresseStruktur>
                    </AdresseValg>
                </KanalAdresseStruktur>
                <MeddelelseTypeSkalIKommunikationMappe>true</MeddelelseTypeSkalIKommunikationMappe>
                <Filer/>
            </Meddelelse>
        </GenerateLetterEkspres_I>
    </soapenv:Body>
</soapenv:Envelope>
